In [5]:
# Grouping & Aggregation of Data

In [ ]:
# First group the data based on something then do aggregation (mean/max/min etc)

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("pd_employee_data.csv")

In [4]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [7]:
# Group the data based on country
df.groupby("country")["income"].min()

# Which Country having minimum income

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       47000.0
Name: income, dtype: float64

In [9]:
# For calculate multiple opr like mean, max and min 
df.groupby("country") ["income"].agg(["mean", "max", "min"])

# we can use agg() or aggregate(), both arr same.

            mean      max      min
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  62000.0  47000.0

In [10]:
# Change column name
df.groupby("country") ["income"].agg(Avg_Salary = "mean", Max_Salary = "max", Min_Salary = "min")

         Avg_Salary  Max_Salary  Min_Salary
country
Canada      62000.0     62000.0     62000.0
China       51000.0     51000.0     51000.0
India       73000.0     73000.0     73000.0
Mexico      45000.0     45000.0     45000.0
Spain           NaN         NaN         NaN
USA         55400.0     62000.0     47000.0

In [11]:
# Different opr based on different col value
df.groupby("country").agg({
    "income" : "mean",
    "age" : "min"
})

          income   age
country
Canada   62000.0   NaN
China    51000.0  27.0
India    73000.0  45.0
Mexico   45000.0   NaN
Spain        NaN  34.0
USA      55400.0  29.0

In [13]:
# Change column name
df.groupby("country").agg(
    Avg_income = ("income","mean"),
    min_age = ("age", "min")
)

         Avg_income  min_age
country
Canada      62000.0      NaN
China       51000.0     27.0
India       73000.0     45.0
Mexico      45000.0      NaN
Spain           NaN     34.0
USA         55400.0     29.0